import "../audio/style/seasons.less";
import AudioPlayer from "./AudioPlayer";
import { tracks } from "../../components/Audio/tracks";
import { useState } from "react";
export default function CollectionPaperBoats(){

    const [trackIndex, setTrackIndex] = useState(14);
    const [currentTrack, setCurrentTrack] = useState(tracks[trackIndex]);
    const currentLable = "نام اثر:قایق های کاغذی";
    const currentText =
      //  "تابلو از مجموعه قایق های کاغذی است ،دلیل شکل گیری این مجموعه وجود اشیاء کوچک و کم ارزشی بود که در گذشته و کودکی همه ما وجود داشته. موضوعات ساده ای که انقدر کم اهمیت بودند که خیلی در حافظه ما باقی نموندن . حال آنکه همان چیزهای کم ارزش و همین فضاهای ساده درواقع آینده های همه ما را ساخته اند ، در رشد و آگاهی همه ما موءثر بودند ، قطعا بزرگنمایی و زیبا و قوی نشان دادن این قایق های کاغذی در سایز و ابعاد بزرگ به عمد است ، چون اینها در ذات خود جنس کاغذ و کم دوام و آسیب پذیر دارند. ";
      `ابعاد : ۱۱۰×۱۱۰\nتکنیک : رنگ و روغن روی بوم\nدرباره اثر : این نقاشی ، بخشی از مجموعه‌ ای است که به قایق‌های کاغذی اختصاص دارد. شکل‌ گیری این مجموعه نشان‌ دهنده وجود اشیاء کوچک و به ظاهر کم‌ ارزشی است که در گذشته و کودکی ما نقش داشته‌ اند؛ موضوعات ساده‌ای که به ندرت در حافظه‌ مان باقی مانده‌اند. اما همین اشیاء و فضاهای ساده، در واقع بنیان‌ گذار آینده های ما بوده و در رشد و آگاهی ما تأثیرگذار بوده‌اند . بزرگ‌نمایی عمدی و نمایش زیبا و قدرتمند این قایق‌های کاغذی در ابعاد بزرگ ، به دلیل طبیعت آسیب‌ پذیر و کم دوام کاغذی آن‌ ها است . هنرمند با این کار قصد داشته است تا انرژی و قدرتی به این اشیاء ببخشد تا اهمیت آن‌ ها به چشم آید . این نیت ، یادآور نوستالژی کودکی همه‌ ی ماست .`;
    return (
      <div  
      className="customMain"
      >
                <AudioPlayer {...{ currentTrack, currentLable, currentText }} />
             </div>
    );
}